/*******************
     циклы
********************/
#include <stdio.h>
int main() {
	/*************************
	 for ( начальное условие; условие выхода из цикла; изменение счетчика)
	{
	  тело цикла, здесь какое то действие
	}
	**************************/
	// простой пример
	for( int i = 0; i < 10; i ++)
	{
	
	printf("%d ", i); 

	}

	// задаем границы - [start; end]
	int start = 0;
	int end = 10;
	for( int i = start; i < end; i ++)
	{
	
	printf("%d ", i); 

	}

	/*************************
	while( условие )
	{
		тело цикла, здесь какое то действие
	}
	**************************/


	return 0;
}