/*******************
     циклы
********************/
#include <stdio.h>
int main() {
	/*************************
	 for ( начальное условие; условие выхода из цикла; изменение счетчика)
	{
	  тело цикла, здесь какое то действие
	}
	**************************/
	// простой пример
	printf("пример 1 \n");

	for( int i = 0; i < 10; i ++)
	{
	
	printf("%d ", i); 

	}

	// задаем границы - [start; end]
	
	printf("пример 2 - с границами \n");
	
	int start = 0;
	int end = 10;
	for( int i = start; i < end; i ++)
	{
	
	printf("%d ", i); 

	}

	/*************************
	while( условие )
	{
		тело цикла, здесь какое то действие
	}
	**************************/
	// простой пример с while
	printf("пример 3 - цикл while \n");
	int i = 0;
	while(i < 10){
		printf("%d ", i);
		i++;
	}

	return 0;
}
